package com.wx.send;

import com.wx.WechatUtils;

public class SendFileWechat {
    public static void main(String[] args) throws Exception{

        String receiver="T1113";
        String message="【流失预警-当月非自然月】\n" +
                "蔡志鹏 ，你好！针对客户发货符合以下任一条件，①超出近三月发货周期平均数的2倍 ②最长一个自然月未发货，将推送至销售人员企业微信，具体客户明细如下：\n" +
                " 义乌大区\n" +
                "  1.蔡志鹏\n" +
                "　　①张云飞-文具U 客户编码:1038566,手机号:13888518682, 9月798元3天/次, 10月542元5天/次, 11月1890元2天/次, 12月0元0天/次, 请于7天内拜访此客户, 并录入CRM系统拜访记。\n" +
                " 叠石桥转运场\n" +
                "  1.李七星\n" +
                "　　①杨寿云-床品U 客户编码:2068850,手机号:13577603011, 9月4326元3天/次, 10月1900元3天/次, 11月1098元5天/次, 12月0元0天/次, 请于7天内拜访此客户, 并录入CRM系统拜访记。\n" +
                "　　②张瑜书-床品U 客户编码:2121819,手机号:18787144857, 9月0元0天/次, 10月2709元3天/次, 11月687元6天/次, 12月0元0天/次, 请于7天内拜访此客户, 并录入CRM系统拜访记。\n" +
                "　　③陈晓如-床品U 客户编码:2135018,手机号:15284402602, 9月1400元4天/次, 10月809元4天/次, 11月804元6天/次, 12月0元0天/次, 请于7天内拜访此客户, 并录入CRM系统拜访记。\n" +
                " 义乌营销一组\n" +
                "  1.蔡志鹏\n" +
                "　　①陈安来-文体/纸品U 客户编码:1041166,手机号:13629687211, 9月1518元3天/次, 10月574元4天/次, 11月1082元5天/次, 12月0元0天/次, 请于7天内拜访此客户, 并录入CRM系统拜访记。\n" +
                "　　②冀云杰-袜子/袜裤U 客户编码:1041268,手机号:15587140888, 9月10218元3天/次, 10月8501元4天/次, 11月3134元3天/次, 12月0元0天/次, 请于7天内拜访此客户, 并录入CRM系统拜访记。\n" +
                "　　③陈静雅-袜子U 客户编码:1421932,手机号:13658866502, 9月680元4天/次, 10月1754元3天/次, 11月1020元2天/次, 12月0元0天/次, 请于7天内拜访此客户, 并录入CRM系统拜访记。\n" +
                " 义乌网点管理部\n" +
                "  1.严旭\n" +
                "　　①邹畅畅-文具U 客户编码:1250250,手机号:13238697858, 9月4372元2天/次, 10月1007元3天/次, 11月1034元4天/次, 12月0元0天/次, 请于7天内拜访此客户, 并录入CRM系统拜访记。\n" +
                "  2.蔡志鹏\n" +
                "　　①杨冬平-文具U 客户编码:2198787,手机号:15887968757, 9月1234元3天/次, 10月824元5天/次, 11月3102元4天/次, 12月0元0天/次, 请于7天内拜访此客户, 并录入CRM系统拜访记。";
        String corpID="ww7a1daec5af2f5422";
        String agentId="1000006";
        String secret="2GpLw4ZFw9KjHm0MT_nkN0R-gqYTrv3deZ8pw4QIM2U";
        WechatUtils.sendMessage(receiver,message,corpID,agentId,secret);

//        String filePath="C:/Users/admin/Desktop/销售客户发货统计_0601_颜孙令.xlsx";
//        WechatUtils.sendFileMessage(receiver,filePath,corpID,agentId,secret);

    }
}
